Revit 2027 API
StructuralSettings.BoundaryConditionAreaAndLineSymbolSpacing Property
 Symbol spacing for boundary conditions.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double BoundaryConditionAreaAndLineSymbolSpacing { get; set; }
Public Property BoundaryConditionAreaAndLineSymbolSpacing As Double
	Get
	Set
public:
property double BoundaryConditionAreaAndLineSymbolSpacing {
	double get ();
	void set (double value);
}
member BoundaryConditionAreaAndLineSymbolSpacing : float with get, set
Property Value
Double
See Also
Reference
StructuralSettings Class
Autodesk.Revit.DB.Structure Namespace